---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterInfo.Offset
zh: 偏移、偏移量
source: html/8bc5c62c-0011-72aa-3faa-4be4e5493ca9.htm
---
# Autodesk.Revit.DB.Architecture.BalusterInfo.Offset Property

**中文**: 偏移、偏移量

The side offset of the baluster/post from the railing path.

## Syntax (C#)
```csharp
public double Offset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for offset must be no more than 30000 feet in absolute value.